In [1]:
#Author: Fardeen Ahmad Khan
#Email: fardeenahmadkhan786@gmail.com

In [2]:
#importations
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns

In [6]:
#reading csv file from local machine as data
data = pd.read_excel(r"F:\Web Dev\Kaggle\Datasets\titanic3.xls")

In [9]:
#first look at our data
data.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [10]:
#checking for null values in our dataframe
data.isnull().sum()

pclass          0
survived        0
name            0
sex             0
age           263
sibsp           0
parch           0
ticket          0
fare            1
cabin        1014
embarked        2
boat          823
body         1188
home.dest     564
dtype: int64

In [13]:
#its clear that the coloumns 'Cabin', 'Body' and 'Boat' are so erraneous we cannot repair them
#hence, let's drop these cols to make our data more reliable
data.drop(['cabin'],axis=1, inplace=True)
data.drop(['boat'],axis=1, inplace=True)
data.drop(['body'],axis=1, inplace=True)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,embarked,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,S,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,S,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,S,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,S,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,S,"Montreal, PQ / Chesterville, ON"

In [15]:
#now that the cols are dropped let's check for missing values again
data.isnull().sum()

pclass         0
survived       0
name           0
sex            0
age          263
sibsp          0
parch          0
ticket         0
fare           1
embarked       2
home.dest    564
dtype: int64

In [16]:
#lets tend to each of these cols one by one.
#age col is clearly numerical 
#since some of the members have not specified their ages, 
#let's assume the mean age of all of them as their age

data['age'].mean()

29.8811345124283

In [17]:
data['age'].fillna(data['age'].mean(), inplace=True)

In [18]:
data.isnull().sum()

pclass         0
survived       0
name           0
sex            0
age            0
sibsp          0
parch          0
ticket         0
fare           1
embarked       2
home.dest    564
dtype: int64

In [19]:
#coming to the fare col, let's find the average fare and fill the null values
data['fare'].mean()

33.29547928134572

In [20]:
data['fare'].fillna(data['fare'].mean(), inplace=True)

In [21]:
data.isnull().sum()

pclass         0
survived       0
name           0
sex            0
age            0
sibsp          0
parch          0
ticket         0
fare           0
embarked       2
home.dest    564
dtype: int64

In [22]:
#the reamining column is embarked, since this value type is categorical we cannot use average here
# we need to see what is the most reported value in this col and can interpolate the same.
data['embarked'].mode()

0    S
dtype: object

In [27]:
data['embarked'].fillna('S',inplace=True)

In [28]:
data.isnull().sum()

pclass         0
survived       0
name           0
sex            0
age            0
sibsp          0
parch          0
ticket         0
fare           0
embarked       0
home.dest    564
dtype: int64

In [30]:
# all null values have been removed from our relevant data
# home. dest column is irrelevant so we will ignore it
# we might as well remove it
data.drop(['home.dest'],axis=1, inplace=True)

In [31]:
data.isnull().sum()

pclass      0
survived    0
name        0
sex         0
age         0
sibsp       0
parch       0
ticket      0
fare        0
embarked    0
dtype: int64